{"titre": "Deep Learning – Expertise", "competences": ["Créer et entraîner un modèle de réseaux de neurones avec Keraset Tensorflow", "Utiliser le deep learning pour tout type d’apprentissage(Classification, prédiction, non supervisé, renforcement)", "Traiter automatiquement des données tabulaires", "Traiter automatiquement des données images", "Traiter automatiquement des données textuelles ou séquentielles", "Proposer une structure de modèle moderne à un problème particulier", "Implémenter les méthodes les plus récentes pour tout typede problème d’apprentissage automatique"], "public": "Ingénieurs et data scientists souhaitant une vision complète  du domaine du deep learning et des méthodes état de l’art.", "prerequis": "Une connaissance de base à Python est requise, ainsi qu’une connaissance  des concepts clefs du machine learning et des réseaux de neurones.", "nb_jours": "> 4 jours", "plan": {"partie-1": {"nom": "Concepts fondamentaux des réseaux de neurones : ", "contenu": ["Lien avec la régression linéaire", "Structure générale des réseaux de neurones", "Rupture de la linéarité : les fonctions d’activations", "Convergence des modèles et choix des optimiseurs du taux d’apprentissage", "Problèmes liés à la disparition ou l’explosion de gradient", "Impact et choix d’un batch", "Techniques de régularisation : Régularisation L1/L2, bruitage,dropout", "Recherche des hyperparamètres", "Problèmes d’interprétabilité", "La librairie Keras pour implémenter des réseaux de neuronesprofonds en python", "Implémentation avancée avec le GradientTape"], "pratique": "* Mise en place d’un réseau de neurones sans code sur des données   simples. Les stagiaires doivent choisir le meilleur ensemble   d’hyperparamètres pour apprendre au mieux un jeu de données   sans surapprentissage et en optimisant le temps de convergence   du modèle. * Implémentation d’un réseau de neurones via Keras sur un problème   de classification multiclasse. Les stagiaires devront utiliser   les concepts de séparation de jeux de données et d’évaluation   introduits en partie 2 et déployer un protocole de recherche   d’hyperparamètres * Implémentation de couches et de modèles personnalisés en   utilisant le GradientTape", "objectifs": ["Concevoir et implémenter des modèles de réseaux de neuronessur des données tabulaires en Keras pour la régression et laclassification", "Évaluer la performance de leurs modèles et adapter les hyperparamètrespour améliorer l’apprentissage", "Identifier les problèmes d’apprentissage tels que le surapprentissageou le manque de données et trouver les moyens de les résoudre", "Reproduire un modèle état de l’art non implémenté dans la librairieKeras"], "duree": "1 journée {text:soft-page-break}"}, "partie-2": {"nom": "Réseaux de neurones à convolutions : ", "contenu": ["Traitement de l’image avec de réseau de neurones : les réseauxde neurones à convolutions", "Principe des convolutions", "Autres mécanismes des réseaux à convolutions : pooling, paddinget strides", "Architectures modernes de réseaux à convolutions : VGG, EfficientNet,DenseNet, etc.", "Techniques avancées utilisant réseaux à convolutions : segmentation,détection d’objet, super-échantillonnage, détection d’anomalies", "Implémentation des réseaux à convolutions dans Keras"], "pratique": "* Implémentation d’un réseau de neurones à convolutions pour   la classification d’un jeu de données de paysage * Implémentation d’un modèle de détections d’anomalies semi-supervisé", "objectifs": ["Implémenter un modèle de réseaux de neurones pour le traitementautomatique d’images", "Définir les modèles pertinents à utiliser en fonction deslimitations techniques et des objectifs à réaliser", "Utiliser le transfert d’apprentissage pour améliorer lesmodèles de traitement automatique d’images", "Implémenter des modèles complexes de réseaux à convolutionspour des taches spécifiques"], "duree": "1 journée"}, "partie-3": {"nom": "Réseaux Récurrents : ", "contenu": ["Réseaux de neurones récurrents", "LSTM : Long Short Term Memory", "GRU : Gated Recurrent Units", "Traitement automatique du texte et de la langue", "Traitement des flux vidéos : association avec les réseauxconvolutionnels", "Limitations des réseaux récurrents et problèmes de convergence"], "pratique": "* Création d’un modèle de reconnaissance d’auteurs automatique * Création d’un modèle de solveur arithmétique sur données   textuelles (Traducteur texte → maths) * Génération automatique de texte", "objectifs": ["Traiter automatiquement des données séquentielles", "Classifier des données séquentielles", "Générer des prédictions ou des séquences futures", "Traiter des données vidéos"], "duree": "1 journée"}, "partie-4": {"nom": "Génération automatique : Auto-encodeurs et GAN : ", "contenu": ["La réduction de dimensions par les réseaux de neurones", "La structure encodeur-décodeur des auto-encodeurs", "Concept d’embedding", "Notions d’espace latent", "Réseaux adversaire : Generative Adversarial Networks", "Problème de convergence et modèles avancés ; WassersteinGAN"], "pratique": "* Implémentation d’un auto-encodeur en keras et visualisation   de l’espace latent", "objectifs": ["Identifier les modèles avancés basés sur des structures encodeur-décodeur", "Concevoir et implémenter des algorithmes des auto-encodeurssur des tâches d’apprentissage non supervisés", "Intégrer des modèles auto-encodeurs à des modèles existantsde traitements supervisés pour réduire la dimensionnalitéd’un jeu de données", "Produire des modèles génératifs de données"], "duree": "1 demi-journée"}, "partie-5": {"nom": "Apprentissage par renforcement : ", "contenu": ["Concepts du reinforcement learning", "Approximation automatique de la fonction d’état", "Deep Q Learning", "Applications"], "pratique": "* Utilisation d’un modèle de renforcement simple pour apprendre   une table de Q-learning", "objectifs": ["Développer un modèle de renforcement", "Estimer le temps, le volume de données et les ressources nécessairespour entrainer un modèle d’apprentissage par renforcement."], "duree": "1 demi-journée"}}}