{"titre": "Deep Learning – Initiation", "competences": ["Identifier les avantages et limitations du Deep Learning", "Avoir une vision à date de l'état de l'art du domaine et ses applications", "Maîtriser les méthodologies et connaître les outils propresaux projets d'Intelligence Artificielle", "Appréhender les enjeux juridiques et éthiques de l’IA", "Identifier les apports potentiels par métier, activité ousecteurs dans l’entreprise"], "public": "Ingénieurs, chefs de projets ou développeurs souhaitant comprendre  les domaines d’application et les bénéfices de l’Intelligence  Artificielle : dirigeants, DSI, chefs de projets, développeurs,  architectes…", "prerequis": "Bonnes connaissances en gestion de projet numérique.   Quelques notions mathématiques : produit scalaire, dérivé,  moyenne, variance", "nb_jours": "> 2 jours", "plan": {"partie-1": {"nom": "Introduction au Deep learning : ", "contenu": ["Les fondements du deep learning : Héritier du machine learning", "Les types de problème et leur classe d’algorithme (supervisé,non supervisé, {text:soft-page-break} renforcement…)", "Les grandes étapes de construction d’un modèle d’apprentissageautomatique de la collecte de données à l’amélioration demodèles", "Besoins et limitations sur un projet en fonction de l’objectiffixé d’un problème d’apprentissage automatique", "Les mécanismes d’évaluation des modèles", "Biais d’analyse et risque d’erreur d’interprétation"], "pratique": "> À partir des besoins des stagiaires sur leur projet, les stagiaires > devront analyser les classes d’algorithmes à utiliser pour > répondre à leur objectif et mesurer les limitations qui s’appliquent > à leur tache (financières, techniques et temporelles)", "objectifs": ["Structurer un projet de machine learning pour un besoin etdes données spécifiques en choisissant les classes des algorithmesles plus pertinentes", "Anticiper les besoins et limitations qui liés à la réalisationde leur tâche de deep learning"], "duree": "1 demi-journée"}, "partie-2": {"nom": "Réseaux de neurones : ", "contenu": ["Lien avec la régression linéaire", "Structure générale des réseaux de neurones", "Rupture de la linéarité : les fonctions d’activations", "Convergence des modèles et choix des optimiseurs du taux d’apprentissage", "Problèmes liés à la disparition ou l’explosion de gradient", "Impact et choix d’un batch", "Recherche des hyperparamètres", "Problèmes d’interprétabilité", "La librairie Keras pour implémenter des réseaux de neuronesprofonds en python"], "pratique": "* Mise en place d’un réseau de neurones sans code sur des données   simples. Les stagiaires doivent choisir le meilleur ensemble   d’hyperparamètres pour apprendre au mieux un jeu de données   sans surapprentissage et en optimisant le temps de convergence   du modèle * {text:soft-page-break} Implémentation d’un réseau de neurones   via Keras sur un problème de classification multiclasse.   Les stagiaires devront utiliser les concepts de séparation   de jeux de données et d’évaluation introduits en partie 2 et   déployer un protocole de recherche d’hyperparamètres.", "objectifs": ["Concevoir et implémenter des modèles de réseaux de neuronessur des données tabulaires en Keras pour la régression et laclassification", "Évaluer la performance de leurs modèles et adapter les hyperparamètrespour améliorer l’apprentissage", "Identifier les problèmes d’apprentissage tels que le surapprentissageou le manque de données et trouver les moyens de les résoudre"], "duree": "1 demi-journée"}, "partie-3": {"nom": "Applications du Deep Learning : ", "contenu": ["Classification de données. Les différents scénarios : donnéebrute, image, son, texte, etc.", "Les enjeux d'une classification de données et les choix impliquéspar un modèle de classification.", "Outils de classification : des réseaux de type MultilayerPerceptron ou Convolutional Neural Network.", "Prédiction d'information et donnée séquentielle/temporelle.Enjeux et limites d'une prédiction d'information.", "Transformation/génération de données. Opération de réinterprétationd'une donnée : débruitage, segmentation d'image...", "Opération de transformation sur un même format : traductionde texte d'une langue à une autre...", "Opération de génération de donnée \"originale\" : Midjourney,génération d'images à partir de présentations textuelles.", "Reinforcement Learning : contrôle d'un environnement."], "pratique": "* Utilisation d’outils disponibles tels que Midjourney, ChatGPT,   mise en place de transfert learning, ...", "objectifs": ["Apréhender les possibilités offertes par les réseaux de neuronesmodernes", "{text:soft-page-break} Utiliser des solutions existantespour améliorer les performances d’une application spécifiquemétier."], "duree": "1 demi-journée"}, "partie-4": {"nom": "Ingénérie et problématiques : ", "contenu": ["Utilisation de machine learning/deep learning dans un projetde développement informatique", "Problèmes théoriques et techniques", "Problèmes juridiques", "Problèmes éthiques"], "pratique": "* Discussions autour de projets existants et documentés", "objectifs": ["Envisager l’utilisation du deep learning dans des projetsen prenant en compte tous les aspects critiques de cette technologie.", "Identifier les avantages, inconvénients et prérequis pourintégrer du deep learning dans un projet"], "duree": "1 demi-journée"}}}